In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df.dtypes

Airline          object
FlightNumber    float64
From_To          object
RecentDelays     object
dtype: object

In [5]:
df.dtypes

Airline          object
FlightNumber    float64
From_To          object
RecentDelays     object
dtype: object

In [6]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [7]:
df.FlightNumber

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [8]:
df.FlightNumber.ffill()

0    10045.0
1    10045.0
2    10065.0
3    10065.0
4    10085.0
Name: FlightNumber, dtype: float64

In [9]:
df.FlightNumber.notnull()

0     True
1    False
2     True
3    False
4     True
Name: FlightNumber, dtype: bool

In [10]:
df.FlightNumber.notnull().cumsum()

0    1
1    1
2    2
3    2
4    3
Name: FlightNumber, dtype: int64

In [11]:
df.FlightNumber.groupby(df.FlightNumber.notnull().cumsum()).describe()

FlightNumber
1             count        1.0
              mean     10045.0
              std          NaN
              min      10045.0
              25%      10045.0
              50%      10045.0
              75%      10045.0
              max      10045.0
2             count        1.0
              mean     10065.0
              std          NaN
              min      10065.0
              25%      10065.0
              50%      10065.0
              75%      10065.0
              max      10065.0
3             count        1.0
              mean     10085.0
              std          NaN
              min      10085.0
              25%      10085.0
              50%      10085.0
              75%      10085.0
              max      10085.0
Name: FlightNumber, dtype: float64

In [12]:
df.FlightNumber = df.FlightNumber.ffill()+df.FlightNumber.groupby(df.FlightNumber.notnull().cumsum()).cumcount()*10

In [13]:
df.FlightNumber

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [14]:
type(df.FlightNumber)

pandas.core.series.Series

# convert float to int using astype()

In [15]:
df.FlightNumber = df.FlightNumber.astype(int)

In [16]:
df.FlightNumber

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [17]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [18]:
sf = df['From_To'].str.split('_',expand=True)
sf.columns=['From','To']

In [19]:
sf

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [20]:
sf['From']=sf['From'].str.title()
sf['To']=sf['To'].str.title()

In [21]:
sf

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [22]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

In [23]:
del df['From_To']

In [24]:
df

               Airline  FlightNumber  RecentDelays
0               KLM(!)         10045      [23, 47]
1    <Air France> (12)         10055            []
2  (British Airways. )         10065  [24, 43, 87]
3       12. Air France         10075          [13]
4          "Swiss Air"         10085      [67, 32]

In [25]:
df = df.join(sf)

In [26]:
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

In [27]:
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

In [29]:
df= df[['Airline','FlightNumber','From','To','RecentDelays']]

In [30]:
df

               Airline  FlightNumber      From         To  RecentDelays
0               KLM(!)         10045    London      Paris      [23, 47]
1    <Air France> (12)         10055    Madrid      Milan            []
2  (British Airways. )         10065    London  Stockholm  [24, 43, 87]
3       12. Air France         10075  Budapest      Paris          [13]
4          "Swiss Air"         10085  Brussels     London      [67, 32]